[
  {
    "title": "Vyltryn Demo - Single Page",
    "category": "Web Development",
    "short": "A responsive single-page site built with HTML, CSS, and JavaScript — designed to demonstrate speed, functionality, and aesthetic balance.",
    "long": "This project demonstrates the fundamentals of front-end web development, focusing on responsiveness, lightweight performance, and clean design principles. The layout is built with pure HTML, CSS, and vanilla JavaScript for maximum control and transparency.",
    "tech": ["HTML", "CSS", "JavaScript"],
    "links": [
      { "label": "View Demo", "href": "https://vyltrynsolutions.github.io/vyltryn-demo/" },
    ]
  },
  {
    "title": "Mobile Game Alpha",
    "category": "Game & Mobile App Development",
    "short": "A lightweight prototype demonstrating core gameplay mechanics and mobile optimization, built using Unity and C#.",
    "long": "A minimal proof-of-concept mobile game created to test Unity’s mobile performance and physics engine. Focused on gameplay fluidity and user interaction without visual clutter.",
    "tech": ["Unity", "C#"],
    "links": [
      { "label": "View Demo", "href": "https://vyltrynsolutions.github.io/mobile-game-alpha/" },
    ]
  },
  {
    "title": "SEO Optimization Strategy",
    "category": "SEO & Digital Marketing",
    "short": "A comprehensive SEO strategy demo showcasing keyword targeting, on-page optimization, and analytics tracking setup.",
    "long": "Demonstrates a structured SEO plan with integrated analytics tracking, meta-optimization, and keyword targeting models for small to medium websites.",
    "tech": ["SEO", "Google Analytics", "Keyword Research"],
    "links": [
      { "label": "View Demo", "href": "https://vyltrynsolutions.github.io/seo-strategy/" }
    ]
  },
  {
    "title": "Brand Design Concepts",
    "category": "Graphic Design",
    "short": "Clean, modern branding mockups demonstrating logo design, color theory, and layout composition.",
    "long": "An exploration of minimal design systems, focusing on brand consistency and professional aesthetics. Includes examples of typography, composition, and logo variations.",
    "tech": ["Adobe Illustrator", "Figma"],
    "links": [
      { "label": "View Gallery", "href": "https://vyltrynsolutions.github.io/brand-design/" }
    ]
  },
  {
    "title": "Interface Concept - Dashboard UI",
    "category": "Graphic UI",
    "short": "A sleek dashboard user interface prototype focused on hierarchy, readability, and usability.",
    "long": "UI design emphasizing structured visual hierarchy, clarity, and effective use of negative space. Ideal for web applications and admin dashboards.",
    "tech": ["Figma", "UI Design", "Prototyping"],
    "links": [
      { "label": "View UI", "href": "https://vyltrynsolutions.github.io/ui-dashboard/" }
    ]
  },
  {
    "title": "User Experience Flow - App Prototype",
    "category": "Graphic UX",
    "short": "A structured UX flow prototype built to demonstrate smooth transitions, intuitive navigation, and human-centered design.",
    "long": "Focused on the user journey through a mobile or web application, showcasing intuitive structure and logical progression for improved engagement.",
    "tech": ["Figma", "UX Design", "Flow Mapping"],
    "links": [
      { "label": "View UX Flow", "href": "https://vyltrynsolutions.github.io/ux-flow/" }
    ]
  },
  {
    "title": "System Integration Overview",
    "category": "Management & System Integration",
    "short": "An example integration flow demonstrating API connectivity, data management, and workflow automation.",
    "long": "This demo outlines backend system integration techniques with API connection examples, structured data mapping, and automated workflow triggers.",
    "tech": ["APIs", "Workflow Automation", "System Architecture"],
    "links": [
      { "label": "View Overview", "href": "https://vyltrynsolutions.github.io/system-integration/" }
    ]
  }
]